from jrdb.datadocs.template import Template


class KZA(Template):
    """
    http://www.jrdb.com/program/Ks/Ks_doc1.txt
    """
    name = '全騎手'
    items = [
        ['trainer_code', '騎手コード', None, '5', '99999', '1', None],
        ['deregistered_flag', '登録抹消フラグ', None, '1', '9', '6', '1:抹消,0:現役'],
        ['deregistered_on', '登録抹消年月日', None, '8', '9', '7', 'YYYYMMDD'],
        ['trainer_name', '騎手名', None, '12', 'X', '15', '全角６文字'],
        ['trainer_kana', '騎手カナ', None, '30', 'X', '27', '全角１５文字'],
        ['trainer_name_short', '騎手名略称', None, '6', 'X', '57', '全角３文字'],
        ['', '所属コード', None, '1', '9', '63', '1:関東,2:関西,3:他'],
        ['', '所属地域名', None, '4', 'X', '64', '全角２文字、地方の場合'],
        ['', '生年月日', None, '8', '9', '68', 'YYYYMMDD'],
        ['', '初免許年', None, '4', '9', '76', 'YYYY'],
        ['', '見習い区分', None, '1', '9', '80', '1:☆(1K減),2:△(2K),3:▲(3K)'],
        ['', '所属厩舎', None, '5', '9', '81', '所属厩舎の調教師コード'],
        ['trainer_comment', '騎手コメント', None, '40', 'X', '86', 'ＪＲＤＢスタッフの騎手評価'],
        ['trainer_comment_date', 'コメント入力年月日', None, '8', 'X', '126', '騎手コメントを入力した年月日'],
        ['', '本年リーディング', None, '3', 'ZZ9', '134', None],
        ['', '本年平地成績', None, '12', 'ZZ9*4', '137', '１－２－３－着外(3*4)'],
        ['', '本年障害成績', None, '12', 'ZZ9*4', '149', '１－２－３－着外(3*4)'],
        ['', '本年特別勝数', None, '3', 'ZZ9', '161', None],
        ['', '本年重賞勝数', None, '3', 'ZZ9', '164', None],
        ['', '昨年リーディング', None, '3', 'ZZ9', '167', None],
        ['', '昨年平地成績', None, '12', 'ZZ9*4', '170', '１－２－３－着外(3*4)'],
        ['', '昨年障害成績', None, '12', 'ZZ9*4', '182', '１－２－３－着外(3*4)'],
        ['', '昨年特別勝数', None, '3', 'ZZ9', '194', None],
        ['', '昨年重賞勝数', None, '3', 'ZZ9', '197', None],
        ['', '通算平地成績', None, '20', 'ZZZZ9*4', '200', '１－２－３－着外(5*4)'],
        ['', '通算障害成績', None, '20', 'ZZZZ9*4', '220', '１－２－３－着外(5*4)'],
        ['', 'データ年月日', None, '8', 'X', '240', 'スペース'],
        ['reserved', '予備', None, '23', 'X', '248', 'スペース'],
        ['newline', '改行', None, '2', 'X', '271', 'ＣＲ・ＬＦ']
    ]
